#Вычисление площади круга
#Условие:
#Дано число rr — радиус круга. Нужно вычислить его площадь, используя формулу:
#S=πr2S = \pi r^2
#где π\pi приближённо равно 3.14159.

pi=3.14159
rr=int(input('ведите радиус:'))
print('площадь:',pi*rr*2)